CSClassifierLSTM(
  (lstm): LSTM(56, 64, batch_first=True, dropout=0.5)
  (dropout): Dropout(p=0.5, inplace=False)
  (fc_1): Linear(in_features=64, out_features=8, bias=True)
  (relu): ReLU()
  (fc): Linear(in_features=8, out_features=1, bias=True)
  (softmax): Softmax(dim=1)
  (sigmoid): Sigmoid()
)